## <span style="color:#90BE6D">Introduction</span>

In [3]:
import pandas as pd
import numpy as np

In [8]:
ser = pd.Series(np.array(['male','female','male']))
ser

0      male
1    female
2      male
dtype: object

In [12]:
dict_data = {'a': 1, 'b': 2, 'c': 3}
dict_ser = pd.Series(dict_data)
dict_ser.index
dict_ser.values

array([1, 2, 3])

In [24]:
df = pd.DataFrame({"Name": ['Tom', 'Jack', 'Steve', 'Ricky'], "Sex": ["Male", "Female", "Male", "Male"], 'Age': [
    28, 34, 29, 42]})
df

    Name     Sex  Age
0    Tom    Male   28
1   Jack  Female   34
2  Steve    Male   29
3  Ricky    Male   42

In [27]:
df.sort_index()

    Name     Sex  Age
0    Tom    Male   28
1   Jack  Female   34
2  Steve    Male   29
3  Ricky    Male   42

In [31]:
df["Age"].apply(lambda age:age+10) # lambda applies for every element

0    38
1    44
2    39
3    52
Name: Age, dtype: int64

## <span style="color:#F3722C">Merge two dataframes using the common column Name</span>

In [3]:
import pandas as pd

In [5]:
df_left = pd.DataFrame({"Name": ['anas', 'ahmad', 'khalid'], "Age":[12,23,34]})
df_left

     Name  Age
0    anas   12
1   ahmad   23
2  khalid   34

In [6]:
df_right = pd.DataFrame({"Name": ['mhd', 'abd', 'anas'], "Salary":[1200,2300,3400]})
df_right

   Name  Salary
0   mhd    1200
1   abd    2300
2  anas    3400

In [22]:
pd.merge(df_left,df_right,on="Name") # returns the intersection (inner)

   Name  Age  Salary
0  anas   12    3400

In [12]:
pd.merge(df_left,df_right,left_on="Name",right_on="Name",how="left") # returns the left

     Name  Age  Salary
0    anas   12  3400.0
1   ahmad   23     NaN
2  khalid   34     NaN

In [14]:
pd.merge(df_left,df_right,left_on="Name",right_on="Name",how="outer") # returns the full outer

     Name   Age  Salary
0    anas  12.0  3400.0
1   ahmad  23.0     NaN
2  khalid  34.0     NaN
3     mhd   NaN  1200.0
4     abd   NaN  2300.0

## <span style="color:#277DA1">Bind two dataframes</span>

In [16]:
pd.concat([df_left, df_right]) # vertical concat

     Name   Age  Salary
0    anas  12.0     NaN
1   ahmad  23.0     NaN
2  khalid  34.0     NaN
0     mhd   NaN  1200.0
1     abd   NaN  2300.0
2    anas   NaN  3400.0

In [17]:
pd.concat([df_left, df_right],ignore_index='true') # continue index

     Name   Age  Salary
0    anas  12.0     NaN
1   ahmad  23.0     NaN
2  khalid  34.0     NaN
3     mhd   NaN  1200.0
4     abd   NaN  2300.0
5    anas   NaN  3400.0

In [18]:
pd.concat([df_left, df_right],axis=1) # horizontal concat

     Name  Age  Name  Salary
0    anas   12   mhd    1200
1   ahmad   23   abd    2300
2  khalid   34  anas    3400

## <span style="color:#F3722C">Dataframes Sorting data exploration</span>

In [24]:
df_left.sort_values(by="Name", ascending=False)

     Name  Age
2  khalid   34
0    anas   12
1   ahmad   23

## <span style="color:#F94144">Data Preprocessing</span>